C++/iocvariadic.org
#+TITLE: An IOC Container using Variadic Templates

* Introduction

  Whilst developing some projects in C++, I have on occasion slipped
  into the sloppy practice of using a Service Locator badly and it got
  me thinking about implementing an IOC container for dependency
  injection in C++, using Variadic Templates, not only as a means to
  solving a problem I had, but also as a way of looking into Variadic
  Templates under VS2012.

  As you will see from some of my previous posts, along with
  developing in C++, I have also had a fair amount of experience of
  WPF and C#. Whilst working with these technologies, I have generally
  employed a Dependency Injection model rather than a Service Locator
  pattern, as I believe this tends to make dependencies more
  explicit. Whilst the same can be achieved with a Service Locator
  patterm, often it is an excuse for a global property bag that can be
  called upon in any part of the code, this almost always leads to
  dependencies being hidden. Whilst developing some projects in C++, I
  have on occasion slipped into the sloppy practice of using a Service
  Locator badly and it got me thinking about implementing an IOC
  container for dependency injection in C++, using Variadic Templates,
  not only as a means to solving a problem I had, but also as a way of
  looking into Variadic Templates under VS2012.

* Service Locator and Dependency Injection

  There has been so much written comparing the two, even to the point
  of declaring a Service Locator an anti-pattern, which I believe is a
  little harsh. As such, I am not going to write too much about it
  here, but point you to a few articles:

  - [[http://martinfowler.com/articles/injection.html][Inversion of Control Container and Dependency Injection, Martin Fowler]]
  - [[http://msdn.microsoft.com/en-us/library/ff648968.aspx][The Service Locator Pattern, MSDN]]   
  - [[http://blog.ploeh.dk/2010/02/03/ServiceLocatorisanAnti-Pattern/][Service Locator is an Anti Pattern, Mark Seemann]]
  - [[http://blog.gauffin.org/2012/09/service-locator-is-not-an-anti-pattern/#.UUNcQ1flLO0][Service Locator is not an Anti Pattern, J Gauffin]]

  Make of them what you will.

* Variadic Templates in C++ 11

  Anyone working in C or C++ will be aware of variadic functions;
  functions that can take a varargs, such as printf:

#+BEGIN_SRC c
  int printf ( const char * format, ... );
#+END_SRC

  The C++ 11 standard extends this concept to templates, allowing
  templates to have a variable number of template parameters: 

#+BEGIN_SRC c++
  template <typename... Ts>
  int safe_printf(const char* f, const Ts&... ts);
#+END_SRC

  A good introduction to them, by Andrei Alexandrescu can be found
  here: 

  [[http://channel9.msdn.com/Events/GoingNative/GoingNative-2012/Variadic-Templates-are-Funadic][Variadic Templates are Funadic (Going Native 2012), Andreio
  Alexandrescu.]]

  As we shall see, as I develop my idea for an IOC Container for
  Dependency Injection, variadic templates, along with lambda
  functions, are the ideal mechanism to implement what I am after. 

