C++/iocvariadic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>An IOC Container using Variadic Templates</title>
<!-- 2016-01-23 Sat 14:44 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">An IOC Container using Variadic Templates</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a></li>
<li><a href="#sec-2">Service Locator and Dependency Injection</a></li>
<li><a href="#sec-3">Variadic Templates in C++ 11</a></li>
<li><a href="#sec-4">My Dependency Problem</a></li>
<li><a href="#sec-5">An IOC Container with Variadic Templates in C++</a></li>
<li><a href="#sec-6">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Whilst developing some projects in C++, I have on occasion slipped
into the sloppy practice of using a Service Locator badly and it got
me thinking about implementing an IOC container for dependency
injection in C++, using Variadic Templates, not only as a means to
solving a problem I had, but also as a way of looking into Variadic
Templates under VS2012.
</p>

<p>
As you will see from some of my previous posts, along with
developing in C++, I have also had a fair amount of experience of
WPF and C#. Whilst working with these technologies, I have generally
employed a Dependency Injection model rather than a Service Locator
pattern, as I believe this tends to make dependencies more
explicit. Whilst the same can be achieved with a Service Locator
patterm, often it is an excuse for a global property bag that can be
called upon in any part of the code, this almost always leads to
dependencies being hidden. Whilst developing some projects in C++, I
have on occasion slipped into the sloppy practice of using a Service
Locator badly and it got me thinking about implementing an IOC
container for dependency injection in C++, using Variadic Templates,
not only as a means to solving a problem I had, but also as a way of
looking into Variadic Templates under VS2012.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Service Locator and Dependency Injection</h2>
<div class="outline-text-2" id="text-2">
<p>
There has been so much written comparing the two, even to the point
of declaring a Service Locator an anti-pattern, which I believe is a
little harsh. As such, I am not going to write too much about it
here, but point you to a few articles:
</p>

<ul class="org-ul">
<li><a href="http://martinfowler.com/articles/injection.html">Inversion of Control Container and Dependency Injection, Martin Fowler</a>
</li>
<li><a href="http://msdn.microsoft.com/en-us/library/ff648968.aspx">The Service Locator Pattern, MSDN</a>   
</li>
<li><a href="http://blog.ploeh.dk/2010/02/03/ServiceLocatorisanAnti-Pattern/">Service Locator is an Anti Pattern, Mark Seemann</a>
</li>
<li><a href="http://blog.gauffin.org/2012/09/service-locator-is-not-an-anti-pattern/#.UUNcQ1flLO0">Service Locator is not an Anti Pattern, J Gauffin</a>
</li>
</ul>

<p>
Make of them what you will.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Variadic Templates in C++ 11</h2>
<div class="outline-text-2" id="text-3">
<p>
Anyone working in C or C++ will be aware of variadic functions;
functions that can take a varargs, such as printf:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b58900;">int</span> <span style="color: #268bd2;">printf</span> ( <span style="color: #859900;">const</span> <span style="color: #b58900;">char</span> * <span style="color: #268bd2;">format</span>, ... );
</pre>
</div>

<p>
The C++ 11 standard extends this concept to templates, allowing
templates to have a variable number of template parameters: 
</p>

<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">typename</span>... Ts&gt;
<span style="color: #b58900;">int</span> <span style="color: #268bd2;">safe_printf</span>(<span style="color: #859900;">const</span> <span style="color: #b58900;">char</span>* <span style="color: #268bd2;">f</span>, <span style="color: #859900;">const</span> <span style="color: #b58900;">Ts</span>&amp;... ts);
</pre>
</div>

<p>
A good introduction to them, by Andrei Alexandrescu can be found
here: 
</p>

<p>
<a href="http://channel9.msdn.com/Events/GoingNative/GoingNative-2012/Variadic-Templates-are-Funadic">Variadic Templates are Funadic (Going Native 2012), Andreio
Alexandrescu.</a>
</p>

<p>
As we shall see, as I develop my idea for an IOC Container for
Dependency Injection, variadic templates, along with lambda
functions, are the ideal mechanism to implement what I am after. 
</p>
</div>
</div>
