C++/iocvariadic.org
* My Dependency Problem

  This example is a simplified example, but imagine I have a
  dependency graph a great deal bigger than the one I'm describing,
  also imagine that these classes are written a little better!. I have
  four classes as follows:

#+BEGIN_SRC cpp +n -r
  class One
  {
  public:
          One(){}
          virtual ~One(){}
          std::string getOutput() const {  return message_;  }
          std::string message_;
  };

  class Two
  {
  public:
          Two(){}
          virtual ~Two(){}
          std::string getOutput() const {  return message_;  }
          std::string message_;
  };

  class Three
  {
  public:
          Three(){}
          virtual ~Three(){}
          std::string getOutput() const {  return "IOC Created";  }
  };

  class DependentClass
  {
  public:
          DependentClass(OnePtr one, TwoPtr two, ThreePtr three) 
                  : one_(one), two_(two), three_(three){}
          void output() const 
                  { 
                          std::cout << "done it" << std::endl; 
                          std::cout << "one - " << one_->getOutput() << std::endl; 
                          std::cout << "two - " << two_->getOutput() << std::endl; 
                          std::cout << "three - " << three_->getOutput() << std::endl; 

                  }
  private:
          DependentClass(){}
          OnePtr one_;
          TwoPtr two_;
          ThreePtr three_;
  };
#+END_SRC

  It is quite clear from the code above that DependentClass is
  dependent on the other three classes.  In my scenario, I want the
  One class to be a singleton, I want the Two class to be declared
  outside any kind of factory method and the Three and DependentClass
  to be managed inside the IOC container. What does this mean in terms
  of code? Well imagine the code being something like this (well,
  actually exactly like this): 

#+BEGIN_SRC cpp +n -r
  IOCContainer container;

  container.RegisterSingletonClass<One>();
  OnePtr one = container.GetInstance<One>();
  one->message_ = "Singleton";

  TwoPtr two(new Two());
  two->message_ = "Registered Instance";
  container.RegisterInstance<Two>(two);

  container.RegisterClass<Three>();
  container.RegisterClass<DependentClass, One, Two, Three>();

  DependentClassPtr instance = container.GetInstance<DependentClass>();

  instance->output();
#+END_SRC

  I want to register a singleton instance of One against my IOC
  container, with the assurance that if an instance of One is used, it
  is always the same one.  I also want to register an instance of Two
  that will also be used when needed. In reality this functionality
  ends up being very similar, although it does have a slight semantic
  difference. I then want to register a Three with no dependencies and
  DependentClass with the three dependencies that is does have. You
  will also notice I am using Ptr classes here. These are just
  typedefs for smart pointers to the various classes: 

#+BEGIN_SRC cpp +n -r
  typedef std::shared_ptr<One> OnePtr;
  typedef std::shared_ptr<Two> TwoPtr;
  typedef std::shared_ptr<Three> ThreePtr;
  typedef std::shared_ptr<DependentClass> DependentClassPtr;
#+END_SRC

