C++/iocvariadic.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">My Dependency Problem</h2>
<div class="outline-text-2" id="text-4">
<p>
This example is a simplified example, but imagine I have a
dependency graph a great deal bigger than the one I'm describing,
also imagine that these classes are written a little better!. I have
four classes as follows:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr"> 1: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">One</span>
<span class="linenr"> 2: </span>{
<span class="linenr"> 3: </span><span style="color: #859900;">public</span>:
<span class="linenr"> 4: </span>        <span style="color: #268bd2;">One</span>(){}
<span class="linenr"> 5: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">One</span>(){}
<span class="linenr"> 6: </span>        <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">string</span> <span style="color: #268bd2;">getOutput</span>() <span style="color: #859900;">const</span> {  <span style="color: #859900;">return</span> message_;  }
<span class="linenr"> 7: </span>        <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">string</span> <span style="color: #268bd2;">message_</span>;
<span class="linenr"> 8: </span>};
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">Two</span>
<span class="linenr">11: </span>{
<span class="linenr">12: </span><span style="color: #859900;">public</span>:
<span class="linenr">13: </span>        <span style="color: #268bd2;">Two</span>(){}
<span class="linenr">14: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">Two</span>(){}
<span class="linenr">15: </span>        <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">string</span> <span style="color: #268bd2;">getOutput</span>() <span style="color: #859900;">const</span> {  <span style="color: #859900;">return</span> message_;  }
<span class="linenr">16: </span>        <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">string</span> <span style="color: #268bd2;">message_</span>;
<span class="linenr">17: </span>};
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">Three</span>
<span class="linenr">20: </span>{
<span class="linenr">21: </span><span style="color: #859900;">public</span>:
<span class="linenr">22: </span>        <span style="color: #268bd2;">Three</span>(){}
<span class="linenr">23: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">Three</span>(){}
<span class="linenr">24: </span>        <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">string</span> <span style="color: #268bd2;">getOutput</span>() <span style="color: #859900;">const</span> {  <span style="color: #859900;">return</span> <span style="color: #2aa198;">"IOC Created"</span>;  }
<span class="linenr">25: </span>};
<span class="linenr">26: </span>
<span class="linenr">27: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">DependentClass</span>
<span class="linenr">28: </span>{
<span class="linenr">29: </span><span style="color: #859900;">public</span>:
<span class="linenr">30: </span>        <span style="color: #268bd2;">DependentClass</span>(<span style="color: #b58900;">OnePtr</span> <span style="color: #268bd2;">one</span>, <span style="color: #b58900;">TwoPtr</span> <span style="color: #268bd2;">two</span>, <span style="color: #b58900;">ThreePtr</span> <span style="color: #268bd2;">three</span>) 
<span class="linenr">31: </span>                : one_(one), <span style="color: #b58900;">two_</span>(<span style="color: #268bd2;">two</span>), <span style="color: #b58900;">three_</span>(<span style="color: #268bd2;">three</span>){}
<span class="linenr">32: </span>        <span style="color: #b58900;">void</span> <span style="color: #268bd2;">output</span>() <span style="color: #859900;">const</span> 
<span class="linenr">33: </span>                { 
<span class="linenr">34: </span>                        <span style="color: #2aa198;">std</span>::cout &lt;&lt; <span style="color: #2aa198;">"done it"</span> &lt;&lt; <span style="color: #2aa198;">std</span>::endl; 
<span class="linenr">35: </span>                        <span style="color: #2aa198;">std</span>::cout &lt;&lt; <span style="color: #2aa198;">"one - "</span> &lt;&lt; one_-&gt;getOutput() &lt;&lt; <span style="color: #2aa198;">std</span>::endl; 
<span class="linenr">36: </span>                        <span style="color: #2aa198;">std</span>::cout &lt;&lt; <span style="color: #2aa198;">"two - "</span> &lt;&lt; two_-&gt;getOutput() &lt;&lt; <span style="color: #2aa198;">std</span>::endl; 
<span class="linenr">37: </span>                        <span style="color: #2aa198;">std</span>::cout &lt;&lt; <span style="color: #2aa198;">"three - "</span> &lt;&lt; three_-&gt;getOutput() &lt;&lt; <span style="color: #2aa198;">std</span>::endl; 
<span class="linenr">38: </span>
<span class="linenr">39: </span>                }
<span class="linenr">40: </span><span style="color: #859900;">private</span>:
<span class="linenr">41: </span>        <span style="color: #268bd2;">DependentClass</span>(){}
<span class="linenr">42: </span>        <span style="color: #b58900;">OnePtr</span> <span style="color: #268bd2;">one_</span>;
<span class="linenr">43: </span>        <span style="color: #b58900;">TwoPtr</span> <span style="color: #268bd2;">two_</span>;
<span class="linenr">44: </span>        <span style="color: #b58900;">ThreePtr</span> <span style="color: #268bd2;">three_</span>;
<span class="linenr">45: </span>};
</pre>
</div>

<p>
It is quite clear from the code above that DependentClass is
dependent on the other three classes.  In my scenario, I want the
One class to be a singleton, I want the Two class to be declared
outside any kind of factory method and the Three and DependentClass
to be managed inside the IOC container. What does this mean in terms
of code? Well imagine the code being something like this (well,
actually exactly like this): 
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">46: </span><span style="color: #b58900;">IOCContainer</span> <span style="color: #268bd2;">container</span>;
<span class="linenr">47: </span>
<span class="linenr">48: </span>container.<span style="color: #b58900;">RegisterSingletonClass</span>&lt;One&gt;();
<span class="linenr">49: </span><span style="color: #b58900;">OnePtr</span> <span style="color: #268bd2;">one</span> = container.<span style="color: #b58900;">GetInstance</span>&lt;One&gt;();
<span class="linenr">50: </span>one-&gt;message_ = <span style="color: #2aa198;">"Singleton"</span>;
<span class="linenr">51: </span>
<span class="linenr">52: </span><span style="color: #b58900;">TwoPtr</span> <span style="color: #268bd2;">two</span>(<span style="color: #859900;">new</span> <span style="color: #b58900;">Two</span>());
<span class="linenr">53: </span>two-&gt;message_ = <span style="color: #2aa198;">"Registered Instance"</span>;
<span class="linenr">54: </span>container.<span style="color: #b58900;">RegisterInstance</span>&lt;Two&gt;(two);
<span class="linenr">55: </span>
<span class="linenr">56: </span>container.<span style="color: #b58900;">RegisterClass</span>&lt;Three&gt;();
<span class="linenr">57: </span>container.<span style="color: #b58900;">RegisterClass</span>&lt;DependentClass, One, Two, Three&gt;();
<span class="linenr">58: </span>
<span class="linenr">59: </span><span style="color: #b58900;">DependentClassPtr</span> <span style="color: #268bd2;">instance</span> = container.<span style="color: #b58900;">GetInstance</span>&lt;DependentClass&gt;();
<span class="linenr">60: </span>
<span class="linenr">61: </span>instance-&gt;output();
</pre>
</div>

<p>
I want to register a singleton instance of One against my IOC
container, with the assurance that if an instance of One is used, it
is always the same one.  I also want to register an instance of Two
that will also be used when needed. In reality this functionality
ends up being very similar, although it does have a slight semantic
difference. I then want to register a Three with no dependencies and
DependentClass with the three dependencies that is does have. You
will also notice I am using Ptr classes here. These are just
typedefs for smart pointers to the various classes: 
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">62: </span><span style="color: #859900;">typedef</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;One&gt; <span style="color: #b58900;">OnePtr</span>;
<span class="linenr">63: </span><span style="color: #859900;">typedef</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;Two&gt; <span style="color: #b58900;">TwoPtr</span>;
<span class="linenr">64: </span><span style="color: #859900;">typedef</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;Three&gt; <span style="color: #b58900;">ThreePtr</span>;
<span class="linenr">65: </span><span style="color: #859900;">typedef</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;DependentClass&gt; <span style="color: #b58900;">DependentClassPtr</span>;
</pre>
</div>
</div>
</div>
