C++/iocvariadic.org
* An IOC Container with Variadic Templates in C++

  So now I have outlined what I am trying to achieve, lets have a look
  at the implementation of the IOCContainer.

#+BEGIN_SRC cpp +n -r
  class IOCContainer
  {
  private:
      class IHolder
      {
      public:
          virtual ~IHolder(){}
          virtual void noop(){}
      };

      template<class T>
      class Holder : public IHolder
      {
      public:
          virtual ~Holder(){}
          std::shared_ptr<T> instance_;
      };

      std::map<std::string, std::function<void*()>> creatorMap_;
      std::map<std::string, std::shared_ptr<IHolder>> instanceMap_;

  public:

      template <class T, typename... Ts>
      void RegisterSingletonClass()
      {
          std::shared_ptr<Holder<T>> holder(new Holder<T>());
          holder->instance_ = std::shared_ptr<T>(new T(GetInstance<Ts>()...));

          instanceMap_[typeid(T).name()] = holder;
      }

      template <class T>
      void RegisterInstance(std::shared_ptr<T> instance)
      {
          std::shared_ptr<Holder<T>> holder(new Holder<T>());
          holder->instance_ = instance;

          instanceMap_[typeid(T).name()] = holder;
      }

      template <class T, typename... Ts>
      void RegisterClass()
      {
          auto createType = [this]() -> T * {
              return new T(GetInstance<Ts>()...);
          };

          creatorMap_[typeid(T).name()] = createType;
      }

      template <class T>
      std::shared_ptr<T> GetInstance()
      {
          if(instanceMap_.find(typeid(T).name()) != instanceMap_.end())
          {
              std::shared_ptr<IHolder> iholder = instanceMap_[typeid(T).name()];

              Holder<T> * holder = dynamic_cast<Holder<T>*>(iholder.get());
              return holder->instance_;
          }
          else
          {
              return std::shared_ptr<T>(static_cast<T*>
                                         (creatorMap_[typeid(T).name()]()));
          }
      }

  };
#+END_SRC

  Lets go through what is an initial solution to this problem. I won't
  pretend this is the most robust solution, but hopefully it will give
  you some idea of where to start, but also give a brief introduction
  to some features of C++ 11. Firstly, I need a couple of collections
  to represent the registry, a collection of registered instances and
  singletons and a collection of creator functions:

#+BEGIN_SRC cpp +n -r
  std::map<std::string, std::function<void*()>> creatorMap_;
  std::map<std::string, std::shared_ptr<IHolder>> instanceMap_;
#+END_SRC

  These two collections use a couple of features that are part of the
  new C++ 11 standard: function objects and shared pointers. I won't
  go into detail here as good references can be found elsewhere:

  - [[http://en.wikipedia.org/wiki/C%2B%2B11#Polymorphic_wrappers_for_function_objects][Polymorphic Wrappers for Function Objects]]
  - [[http://en.wikipedia.org/wiki/Smart_pointer#C.2B.2B_smart_pointers][C++ Smart Pointers]]

  You will also notice a Holder interface and template class: 

#+BEGIN_SRC cpp +n -r
  class IHolder
  {
  public:
          virtual ~IHolder(){}
          virtual void noop(){}
  };

  template<class T>
  class Holder : public IHolder
  {
  public:
          virtual ~Holder(){}
          std::shared_ptr<T> instance_;
  };
#+END_SRC

  I want the classes that are registered with the IOC Container to be
  independent of a specific interface, but unfortunately std library
  container require the contained class to be the same type. By
  providing an interface with a no-op method (can't remember why this
  was neccesary?) and a template class that implements that interface
  I can provide a useful wrapper for an instance of a class that can
  be held in a container, such that the class contained can really be
  anything. You will also notice that the registered creator functions
  return a void pointer. I am not completely happy about this, it
  requires some internal casting that might not be the best C++ code,
  but solves the problem for me. Suggestions for better ways of doing
  this are very welcome :) So we now have the basic internal types and
  collections to represent the data contained in the registry, lets
  have a look at some of the methods on the IOC container. Firstly the
  simplest method, for registering existing instances of a class:

#+BEGIN_SRC cpp +n -r
template <class T>
void RegisterInstance(std::shared_ptr<T> instance)
{
    std::shared_ptr<Holder<T>> holder(new Holder<T>());
    holder->instance_ = instance;

    instanceMap_[typeid(T).name()] = holder;
}
#+END_SRC

  This does nothing new to C++ 11. It simply creates a new shared
  pointer to the shared pointer instance (mmm!) and adds it to the
  registry using the name from the typeid as the key. This could
  easily be extended to allow for multiple named registrations as
  well. Now lets have a look at the RegisterClass method, which uses a
  lot of C++ 11 features:

#+BEGIN_SRC cpp +n -r
  template <class T, typename... Ts>
  void RegisterClass()
  {
          auto createType = [this]() -> T * {
                  return new T(GetInstance<Ts>()...);
          };

          creatorMap_[typeid(T).name()] = createType;
  }
#+END_SRC

  Firstly we have a Variadic Template method that can take a variable
  number of template parameters. This allows classes to be registered
  with dependencies on 0 or more other types. Our creator functions
  are then declared as a lambda function createType, with an inferred
  type using the auto keyword. The creator method expands the template
  parameters using the GetInstance<>() method to create a new instance
  of T. The RegisterSingleton method is similar:

#+BEGIN_SRC cpp +n -r
  template <class T, typename... Ts>
  void RegisterSingletonClass()
  {
          std::shared_ptr<Holder<T>> holder(new Holder<T>());
          holder->instance_ = std::shared_ptr<T>(new T(GetInstance<Ts>()...));

          instanceMap_[typeid(T).name()] = holder;
  }
#+END_SRC

  Although rather than adding a creator function, we just create an
  instance directly and add it to the registry of instances. All that
  leaves now is the GetInstance method:

#+BEGIN_SRC cpp +n -r
  template <class T>
  std::shared_ptr<T> GetInstance()
  {
          if(instanceMap_.find(typeid(T).name()) != instanceMap_.end())
          {
                  std::shared_ptr<IHolder> iholder = instanceMap_[typeid(T).name()];

                  Holder<T> * holder = dynamic_cast<Holder<T>*>(iholder.get());
                  return holder->instance_;
          }
          else
          {
                  return std::shared_ptr<T>(static_cast<T*>(creatorMap_[typeid(T).name()]()));
          }
  }
#+END_SRC

  First we check to see if we have an instance registered and return
  that instance. We have to do a fairly safe C++ cast here to cast the
  holder to the right type. If there is no registered instance then we
  create one using the creator registered for that type and use a
  slightly more hairy cast to get a pointer to the correct type to
  return.

