C++/iocvariadic.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">An IOC Container with Variadic Templates in C++</h2>
<div class="outline-text-2" id="text-5">
<p>
So now I have outlined what I am trying to achieve, lets have a look
at the implementation of the IOCContainer.
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr"> 66: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">IOCContainer</span>
<span class="linenr"> 67: </span>{
<span class="linenr"> 68: </span><span style="color: #859900;">private</span>:
<span class="linenr"> 69: </span>    <span style="color: #859900;">class</span> <span style="color: #b58900;">IHolder</span>
<span class="linenr"> 70: </span>    {
<span class="linenr"> 71: </span>    <span style="color: #859900;">public</span>:
<span class="linenr"> 72: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">IHolder</span>(){}
<span class="linenr"> 73: </span>        <span style="color: #859900;">virtual</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">noop</span>(){}
<span class="linenr"> 74: </span>    };
<span class="linenr"> 75: </span>
<span class="linenr"> 76: </span>    <span style="color: #859900;">template</span>&lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>&gt;
<span class="linenr"> 77: </span>    <span style="color: #859900;">class</span> <span style="color: #b58900;">Holder</span> : <span style="color: #859900;">public</span> <span style="color: #b58900;">IHolder</span>
<span class="linenr"> 78: </span>    {
<span class="linenr"> 79: </span>    <span style="color: #859900;">public</span>:
<span class="linenr"> 80: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">Holder</span>(){}
<span class="linenr"> 81: </span>        <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt; <span style="color: #268bd2;">instance_</span>;
<span class="linenr"> 82: </span>    };
<span class="linenr"> 83: </span>
<span class="linenr"> 84: </span>    <span style="color: #2aa198;">std</span>::map&lt;<span style="color: #2aa198;">std</span>::string, <span style="color: #2aa198;">std</span>::function&lt;<span style="color: #b58900;">void</span>*()&gt;&gt; creatorMap_;
<span class="linenr"> 85: </span>    <span style="color: #2aa198;">std</span>::map&lt;<span style="color: #2aa198;">std</span>::string, <span style="color: #2aa198;">std</span>::shared_ptr&lt;IHolder&gt;&gt; instanceMap_;
<span class="linenr"> 86: </span>
<span class="linenr"> 87: </span><span style="color: #859900;">public</span>:
<span class="linenr"> 88: </span>
<span class="linenr"> 89: </span>    <span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>, <span style="color: #859900;">typename</span>... Ts&gt;
<span class="linenr"> 90: </span>    <span style="color: #b58900;">void</span> <span style="color: #268bd2;">RegisterSingletonClass</span>()
<span class="linenr"> 91: </span>    {
<span class="linenr"> 92: </span>        <span style="color: #2aa198;">std</span>::shared_ptr&lt;Holder&lt;T&gt;&gt; holder(<span style="color: #859900;">new</span> <span style="color: #b58900;">Holder</span>&lt;T&gt;());
<span class="linenr"> 93: </span>        holder-&gt;instance_ = <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt;(<span style="color: #859900;">new</span> <span style="color: #b58900;">T</span>(<span style="color: #b58900;">GetInstance</span>&lt;Ts&gt;()...));
<span class="linenr"> 94: </span>
<span class="linenr"> 95: </span>        instanceMap_[<span style="color: #859900;">typeid</span>(<span style="color: #b58900;">T</span>).name()] = holder;
<span class="linenr"> 96: </span>    }
<span class="linenr"> 97: </span>
<span class="linenr"> 98: </span>    <span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>&gt;
<span class="linenr"> 99: </span>    <span style="color: #b58900;">void</span> <span style="color: #268bd2;">RegisterInstance</span>(<span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt; <span style="color: #268bd2;">instance</span>)
<span class="linenr">100: </span>    {
<span class="linenr">101: </span>        <span style="color: #2aa198;">std</span>::shared_ptr&lt;Holder&lt;T&gt;&gt; holder(<span style="color: #859900;">new</span> <span style="color: #b58900;">Holder</span>&lt;T&gt;());
<span class="linenr">102: </span>        holder-&gt;instance_ = instance;
<span class="linenr">103: </span>
<span class="linenr">104: </span>        instanceMap_[<span style="color: #859900;">typeid</span>(<span style="color: #b58900;">T</span>).name()] = holder;
<span class="linenr">105: </span>    }
<span class="linenr">106: </span>
<span class="linenr">107: </span>    <span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>, <span style="color: #859900;">typename</span>... Ts&gt;
<span class="linenr">108: </span>    <span style="color: #b58900;">void</span> <span style="color: #268bd2;">RegisterClass</span>()
<span class="linenr">109: </span>    {
<span class="linenr">110: </span>        <span style="color: #859900;">auto</span> <span style="color: #b58900;">createType</span> = [<span style="color: #859900;">this</span>]() -&gt; T * {
<span class="linenr">111: </span>            <span style="color: #859900;">return</span> <span style="color: #859900;">new</span> <span style="color: #b58900;">T</span>(<span style="color: #b58900;">GetInstance</span>&lt;Ts&gt;()...);
<span class="linenr">112: </span>        };
<span class="linenr">113: </span>
<span class="linenr">114: </span>        creatorMap_[<span style="color: #859900;">typeid</span>(<span style="color: #b58900;">T</span>).name()] = createType;
<span class="linenr">115: </span>    }
<span class="linenr">116: </span>
<span class="linenr">117: </span>    <span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>&gt;
<span class="linenr">118: </span>    <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt; <span style="color: #268bd2;">GetInstance</span>()
<span class="linenr">119: </span>    {
<span class="linenr">120: </span>        <span style="color: #859900;">if</span>(instanceMap_.find(<span style="color: #859900;">typeid</span>(<span style="color: #b58900;">T</span>).name()) != instanceMap_.end())
<span class="linenr">121: </span>        {
<span class="linenr">122: </span>            <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">IHolder</span>&gt; <span style="color: #268bd2;">iholder</span> = instanceMap_[<span style="color: #859900;">typeid</span>(<span style="color: #b58900;">T</span>).name()];
<span class="linenr">123: </span>
<span class="linenr">124: </span>            <span style="color: #b58900;">Holder</span>&lt;<span style="color: #b58900;">T</span>&gt; * <span style="color: #268bd2;">holder</span> = <span style="color: #859900;">dynamic_cast</span>&lt;<span style="color: #b58900;">Holder</span>&lt;T&gt;*&gt;(iholder.get());
<span class="linenr">125: </span>            <span style="color: #859900;">return</span> holder-&gt;instance_;
<span class="linenr">126: </span>        }
<span class="linenr">127: </span>        <span style="color: #859900;">else</span>
<span class="linenr">128: </span>        {
<span class="linenr">129: </span>            <span style="color: #859900;">return</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt;(<span style="color: #859900;">static_cast</span>&lt;T*&gt;
<span class="linenr">130: </span>                                       (<span style="color: #b58900;">creatorMap_</span>[<span style="color: #859900;">typeid</span>(<span style="color: #b58900;">T</span>).name()]()));
<span class="linenr">131: </span>        }
<span class="linenr">132: </span>    }
<span class="linenr">133: </span>
<span class="linenr">134: </span>};
</pre>
</div>

<p>
Lets go through what is an initial solution to this problem. I won't
pretend this is the most robust solution, but hopefully it will give
you some idea of where to start, but also give a brief introduction
to some features of C++ 11. Firstly, I need a couple of collections
to represent the registry, a collection of registered instances and
singletons and a collection of creator functions:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">135: </span><span style="color: #2aa198;">std</span>::map&lt;<span style="color: #2aa198;">std</span>::string, <span style="color: #2aa198;">std</span>::function&lt;<span style="color: #b58900;">void</span>*()&gt;&gt; creatorMap_;
<span class="linenr">136: </span><span style="color: #2aa198;">std</span>::map&lt;<span style="color: #2aa198;">std</span>::string, <span style="color: #2aa198;">std</span>::shared_ptr&lt;IHolder&gt;&gt; instanceMap_;
</pre>
</div>

<p>
These two collections use a couple of features that are part of the
new C++ 11 standard: function objects and shared pointers. I won't
go into detail here as good references can be found elsewhere:
</p>

<ul class="org-ul">
<li><a href="http://en.wikipedia.org/wiki/C++11#Polymorphic_wrappers_for_function_objects">Polymorphic Wrappers for Function Objects</a>
</li>
<li><a href="http://en.wikipedia.org/wiki/Smart_pointer#C.2B.2B_smart_pointers">C++ Smart Pointers</a>
</li>
</ul>

<p>
You will also notice a Holder interface and template class: 
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">137: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">IHolder</span>
<span class="linenr">138: </span>{
<span class="linenr">139: </span><span style="color: #859900;">public</span>:
<span class="linenr">140: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">IHolder</span>(){}
<span class="linenr">141: </span>        <span style="color: #859900;">virtual</span> <span style="color: #b58900;">void</span> <span style="color: #268bd2;">noop</span>(){}
<span class="linenr">142: </span>};
<span class="linenr">143: </span>
<span class="linenr">144: </span><span style="color: #859900;">template</span>&lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>&gt;
<span class="linenr">145: </span><span style="color: #859900;">class</span> <span style="color: #b58900;">Holder</span> : <span style="color: #859900;">public</span> <span style="color: #b58900;">IHolder</span>
<span class="linenr">146: </span>{
<span class="linenr">147: </span><span style="color: #859900;">public</span>:
<span class="linenr">148: </span>        <span style="color: #859900;">virtual</span> ~<span style="color: #268bd2;">Holder</span>(){}
<span class="linenr">149: </span>        <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt; <span style="color: #268bd2;">instance_</span>;
<span class="linenr">150: </span>};
</pre>
</div>

<p>
I want the classes that are registered with the IOC Container to be
independent of a specific interface, but unfortunately std library
container require the contained class to be the same type. By
providing an interface with a no-op method (can't remember why this
was neccesary?) and a template class that implements that interface
I can provide a useful wrapper for an instance of a class that can
be held in a container, such that the class contained can really be
anything. You will also notice that the registered creator functions
return a void pointer. I am not completely happy about this, it
requires some internal casting that might not be the best C++ code,
but solves the problem for me. Suggestions for better ways of doing
this are very welcome :) So we now have the basic internal types and
collections to represent the data contained in the registry, lets
have a look at some of the methods on the IOC container. Firstly the
simplest method, for registering existing instances of a class:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">151: </span><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>&gt;
<span class="linenr">152: </span><span style="color: #b58900;">void</span> <span style="color: #268bd2;">RegisterInstance</span>(<span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt; <span style="color: #268bd2;">instance</span>)
<span class="linenr">153: </span>{
<span class="linenr">154: </span>    <span style="color: #2aa198;">std</span>::shared_ptr&lt;Holder&lt;T&gt;&gt; holder(<span style="color: #859900;">new</span> <span style="color: #b58900;">Holder</span>&lt;T&gt;());
<span class="linenr">155: </span>    holder-&gt;instance_ = instance;
<span class="linenr">156: </span>
<span class="linenr">157: </span>    instanceMap_[<span style="color: #859900;">typeid</span>(T).name()] = holder;
<span class="linenr">158: </span>}
</pre>
</div>

<p>
This does nothing new to C++ 11. It simply creates a new shared
pointer to the shared pointer instance (mmm!) and adds it to the
registry using the name from the typeid as the key. This could
easily be extended to allow for multiple named registrations as
well. Now lets have a look at the RegisterClass method, which uses a
lot of C++ 11 features:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">159: </span><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>, <span style="color: #859900;">typename</span>... Ts&gt;
<span class="linenr">160: </span><span style="color: #b58900;">void</span> <span style="color: #268bd2;">RegisterClass</span>()
<span class="linenr">161: </span>{
<span class="linenr">162: </span>        <span style="color: #859900;">auto</span> <span style="color: #b58900;">createType</span> = [<span style="color: #859900;">this</span>]() -&gt; T * {
<span class="linenr">163: </span>                <span style="color: #859900;">return</span> <span style="color: #859900;">new</span> <span style="color: #b58900;">T</span>(<span style="color: #b58900;">GetInstance</span>&lt;Ts&gt;()...);
<span class="linenr">164: </span>        };
<span class="linenr">165: </span>
<span class="linenr">166: </span>        creatorMap_[<span style="color: #859900;">typeid</span>(T).name()] = createType;
<span class="linenr">167: </span>}
</pre>
</div>

<p>
Firstly we have a Variadic Template method that can take a variable
number of template parameters. This allows classes to be registered
with dependencies on 0 or more other types. Our creator functions
are then declared as a lambda function createType, with an inferred
type using the auto keyword. The creator method expands the template
parameters using the GetInstance&lt;&gt;() method to create a new instance
of T. The RegisterSingleton method is similar:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">168: </span><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>, <span style="color: #859900;">typename</span>... Ts&gt;
<span class="linenr">169: </span><span style="color: #b58900;">void</span> <span style="color: #268bd2;">RegisterSingletonClass</span>()
<span class="linenr">170: </span>{
<span class="linenr">171: </span>        <span style="color: #2aa198;">std</span>::shared_ptr&lt;Holder&lt;T&gt;&gt; holder(<span style="color: #859900;">new</span> <span style="color: #b58900;">Holder</span>&lt;T&gt;());
<span class="linenr">172: </span>        holder-&gt;instance_ = <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt;(<span style="color: #859900;">new</span> <span style="color: #b58900;">T</span>(<span style="color: #b58900;">GetInstance</span>&lt;Ts&gt;()...));
<span class="linenr">173: </span>
<span class="linenr">174: </span>        instanceMap_[<span style="color: #859900;">typeid</span>(T).name()] = holder;
<span class="linenr">175: </span>}
</pre>
</div>

<p>
Although rather than adding a creator function, we just create an
instance directly and add it to the registry of instances. All that
leaves now is the GetInstance method:
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span class="linenr">176: </span><span style="color: #859900;">template</span> &lt;<span style="color: #859900;">class</span> <span style="color: #b58900;">T</span>&gt;
<span class="linenr">177: </span><span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt; <span style="color: #268bd2;">GetInstance</span>()
<span class="linenr">178: </span>{
<span class="linenr">179: </span>        <span style="color: #859900;">if</span>(instanceMap_.find(<span style="color: #859900;">typeid</span>(T).name()) != instanceMap_.end())
<span class="linenr">180: </span>        {
<span class="linenr">181: </span>                <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;IHolder&gt; <span style="color: #268bd2;">iholder</span> = instanceMap_[<span style="color: #859900;">typeid</span>(T).name()];
<span class="linenr">182: </span>
<span class="linenr">183: </span>                <span style="color: #b58900;">Holder</span>&lt;<span style="color: #b58900;">T</span>&gt; * <span style="color: #268bd2;">holder</span> = <span style="color: #859900;">dynamic_cast</span>&lt;<span style="color: #b58900;">Holder</span>&lt;T&gt;*&gt;(iholder.get());
<span class="linenr">184: </span>                <span style="color: #859900;">return</span> holder-&gt;instance_;
<span class="linenr">185: </span>        }
<span class="linenr">186: </span>        <span style="color: #859900;">else</span>
<span class="linenr">187: </span>        {
<span class="linenr">188: </span>                <span style="color: #859900;">return</span> <span style="color: #2aa198;">std</span>::<span style="color: #b58900;">shared_ptr</span>&lt;<span style="color: #b58900;">T</span>&gt;(<span style="color: #859900;">static_cast</span>&lt;T*&gt;(creatorMap_[<span style="color: #859900;">typeid</span>(T).name()]()));
<span class="linenr">189: </span>        }
<span class="linenr">190: </span>}
</pre>
</div>

<p>
First we check to see if we have an instance registered and return
that instance. We have to do a fairly safe C++ cast here to cast the
holder to the right type. If there is no registered instance then we
create one using the creator registered for that type and use a
slightly more hairy cast to get a pointer to the correct type to
return.
</p>
</div>
</div>
